; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v3)
		(pred_6 ?v6)
		(pred_5 ?v1)
		(pred_3 ?v1)
		(pred_1 ?v6 ?v1)
		(pred_4)
		(pred_2 ?v6))

   (:action op_2
       :parameters  (?v8 ?v5)
       :precondition (and (not-eq ?v8 ?v5) 
                          (pred_5 ?v8) (pred_5 ?v5) (pred_3 ?v8))
       :effect (and  (pred_3 ?v5)
		     (not (pred_3 ?v8))))


   (:action op_1
       :parameters (?v2 ?v4)
       :precondition  (and  (pred_6 ?v2) (pred_5 ?v4)
			    (pred_1 ?v2 ?v4) (pred_3 ?v4) (pred_4))
       :effect (and (pred_2 ?v2)
		    (not (pred_1 ?v2 ?v4)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v2  ?v4)
       :precondition  (and  (pred_6 ?v2) (pred_5 ?v4)
			    (pred_2 ?v2) (pred_3 ?v4))
       :effect (and (pred_1 ?v2 ?v4)
		    (pred_4)
		    (not (pred_2 ?v2)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_05 obj_04 obj_02 obj_07 
          obj_06 obj_01 obj_03 
)
(:init
(pred_5 obj_05)
(pred_5 obj_04)
(pred_5 obj_02)
(pred_5 obj_07)
(pred_6 obj_06)
(pred_6 obj_01)
(pred_6 obj_03)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(pred_4)
(pred_1 obj_06 obj_04)
(pred_1 obj_01 obj_04)
(pred_1 obj_03 obj_04)
(pred_3 obj_07)
)
(:goal
(and
(pred_1 obj_06 obj_02)
(pred_1 obj_01 obj_05)
(pred_1 obj_03 obj_07)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_06 obj_02) (pred_3 obj_05))
    (sometime-before  (pred_1 obj_01 obj_05) (pred_3 obj_02))
    (sometime-before  (pred_1 obj_03 obj_07) (pred_3 obj_05))
  )
)
)

; plan
1. (op_2 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_04)
   goals met: 0 of 3
2. (op_1 obj_03 obj_04)
   deleted: (pred_1 obj_03 obj_04) (pred_4)
   added: (pred_2 obj_03)
   goals met: 0 of 3
3. (op_2 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_02)
   goals met: 0 of 3
4. (op_3 obj_03 obj_02)
   deleted: (pred_2 obj_03)
   added: (pred_1 obj_03 obj_02) (pred_4)
   goals met: 0 of 3
5. (op_2 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_04)
   goals met: 0 of 3
6. (op_1 obj_01 obj_04)
   deleted: (pred_1 obj_01 obj_04) (pred_4)
   added: (pred_2 obj_01)
   goals met: 0 of 3
7. (op_2 obj_04 obj_05)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_05)
   goals met: 0 of 3
8. (op_3 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_1 obj_01 obj_05) (pred_4)
   goals met: 1 of 3
9. (op_2 obj_05 obj_04)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_04)
   goals met: 1 of 3
10. (op_1 obj_06 obj_04)
   deleted: (pred_1 obj_06 obj_04) (pred_4)
   added: (pred_2 obj_06)
   goals met: 1 of 3
11. (op_2 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_02)
   goals met: 1 of 3
12. (op_3 obj_06 obj_02)
   deleted: (pred_2 obj_06)
   added: (pred_1 obj_06 obj_02) (pred_4)
   goals met: 2 of 3
13. (op_1 obj_03 obj_02)
   deleted: (pred_1 obj_03 obj_02) (pred_4)
   added: (pred_2 obj_03)
   goals met: 2 of 3
14. (op_2 obj_02 obj_07)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_07)
   goals met: 2 of 3
15. (op_3 obj_03 obj_07)
   deleted: (pred_2 obj_03)
   added: (pred_1 obj_03 obj_07) (pred_4)
   goals met: 3 of 3
